package my.day15.a.polymorphism.copy;
/*
-----------------------------------------------------------------------------------------------------------------------
접근제한자(접근지정자, accessmodifier)   자기자신클래스내부      동일패키지에있는다른클래스      다른패키지에있는하위(자식)클래스        그외의영역  
----------------------------------------------------------------------------------------------------------------------- 
public    (초록색)                          O                    O                         O                 O  
protected (노랑색)                          O                    O                         O                 X
default                                   O                    O                         X                 X
private                                   O                    X                         X                 X
*/
public class Animal { //Animal은 눈에 안보이지만 extends Object가 숨겨져있음
	

}
